apache/nuttx/boards/arm/stm32f4/stm32f429i-disco/src/stm32_ili93414ws.c
/****************************************************************************
 * boards/arm/stm32f4/stm32f429i-disco/src/stm32_ili93414ws.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/* References:
 * ILI9341_DS_V1.10.pdf (Rev: 1.10), "a-Si TFT LCD Single Chip
 * Driver 240RGBx320 Resolution and 262K color", ILI TECHNOLOGY
 * CORP., http://www.ilitek.com.
 * ILI TECHNOLOGY CORP., http://www.ilitek.com.
 */

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <sys/types.h>
#include <inttypes.h>
#include <stdbool.h>
#include <errno.h>

#include <nuttx/debug.h>
#include <nuttx/irq.h>
#include <nuttx/arch.h>
#include <nuttx/spi/spi.h>

#include "stm32_rcc.h"
#include "stm32_spi.h"
#include "stm32f429i-disco.h"

#include <arch/board/board.h>

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Display is connected at spi5 device */

#define ILI93414WS_SPI_DEVICE       5

/* spi frequency based on arch/arm/src/common/stm32/stm32_spi.h */

#ifndef CONFIG_STM32F429I_DISCO_ILI9341_SPIFREQUENCY
#  define CONFIG_STM32F429I_DISCO_ILI9341_SPIFREQUENCY      20000000
#endif

#if CONFIG_STM32F429I_DISCO_ILI9341_SPIFREQUENCY >= \
                                        (STM32_PCLK1_FREQUENCY >> 1)
#  define ILI93414WS_SPI_BR         SPI_CR1_FPCLCKd2    /* 000: fPCLK/2 */
#  define ILI93414WS_BAUD_DIVISOR   2
#elif CONFIG_STM32F429I_DISCO_ILI9341_SPIFREQUENCY >= \
                                        (STM32_PCLK1_FREQUENCY >> 2)
#  define ILI93414WS_SPI_BR         SPI_CR1_FPCLCKd4    /* 001: fPCLK/4 */
#  define ILI93414WS_BAUD_DIVISOR   4
#elif CONFIG_STM32F429I_DISCO_ILI9341_SPIFREQUENCY >= \
                                        (STM32_PCLK1_FREQUENCY >> 3)
#  define ILI93414WS_SPI_BR         SPI_CR1_FPCLCKd8    /* 010: fPCLK/8 */
#  define ILI93414WS_BAUD_DIVISOR   8
#elif CONFIG_STM32F429I_DISCO_ILI9341_SPIFREQUENCY >= \
                                        (STM32_PCLK1_FREQUENCY >> 4)
#  define ILI93414WS_SPI_BR         SPI_CR1_FPCLCKd16   /* 011: fPCLK/16 */
#  define ILI93414WS_BAUD_DIVISOR   16
#elif CONFIG_STM32F429I_DISCO_ILI9341_SPIFREQUENCY >= \
                                        (STM32_PCLK1_FREQUENCY >> 5)
#  define ILI93414WS_SPI_BR         SPI_CR1_FPCLCKd32   /* 100: fPCLK/32 */
#  define ILI93414WS_BAUD_DIVISOR   32
#elif CONFIG_STM32F429I_DISCO_ILI9341_SPIFREQUENCY >= \
                                        (STM32_PCLK1_FREQUENCY >> 6)
#  define ILI93414WS_SPI_BR         SPI_CR1_FPCLCKd64   /* 101: fPCLK/64 */
#  define ILI93414WS_BAUD_DIVISOR   64
#elif CONFIG_STM32F429I_DISCO_ILI9341_SPIFREQUENCY >= \
                                        (STM32_PCLK1_FREQUENCY >> 7)
#  define ILI93414WS_SPI_BR         SPI_CR1_FPCLCKd128  /* 110: fPCLK/128 */
#  define ILI93414WS_BAUD_DIVISOR   128
#else
#  define ILI93414WS_SPI_BR         SPI_CR1_FPCLCKd256  /* 111: fPCLK/256 */
#  define ILI93414WS_BAUD_DIVISOR   256
#endif

/* Permitted clock delay for a pixel transmission from the LCD gram.
 * Calculated by cpu clock / (spi clock / baud divisor)
 */

#define ILI93414WS_RECV_CLK         (STM32_SYSCLK_FREQUENCY / \
                                    (STM32_PCLK1_FREQUENCY / \
                                    ILI93414WS_BAUD_DIVISOR))

/* Definition of the spi mcu register */

#define ILI93414WS_SPI_BASE         STM32_SPI5_BASE
#define ILI93414WS_SPI_CR1          (ILI93414WS_SPI_BASE + STM32_SPI_CR1_OFFSET)
#define ILI93414WS_SPI_CR2          (ILI93414WS_SPI_BASE + STM32_SPI_CR2_OFFSET)
#define ILI93414WS_SPI_SR           (ILI93414WS_SPI_BASE + STM32_SPI_SR_OFFSET)
#define ILI93414WS_SPI_DR           (ILI93414WS_SPI_BASE + STM32_SPI_DR_OFFSET)

/* Activates the usage of the spi interface structure if several active
 * devices connected on the SPI5 bus, e.g. LCD Display, MEMS. This will
 * perform locking of the spi bus by SPI_LOCK at each selection of the SPI5
 * device.
 */

#ifdef CONFIG_STM32_SPI5
#  define ILI93414WS_SPI
#endif

/****************************************************************************
 * Private Types
 ****************************************************************************/

struct ili93414ws_lcd_s
{
  /* Publicly visible device structure */

  struct ili9341_lcd_s dev;

#ifdef ILI93414WS_SPI
  /* Reference to spi device structure */

  struct spi_dev_s *spi;

  /* Backup cr1 register at selection */

  uint16_t cr1;

  /* Backup cr2 register at selection */

  uint16_t cr2;
#endif

#ifndef CONFIG_STM32F429I_DISCO_ILI9341_SPIBITS16
  /* Marks current display operation mode (gram or command/parameter)
   * If 16-bit spi mode is enabled for pixel data operation, the flag is not
   * necessary. The pixel data operation mode can then be recognized by the
   * DFF flag in the cr1 register.
   */

  uint8_t gmode;
#endif
};

/****************************************************************************
 * Private Function Protototypes
 ****************************************************************************/

/* Low-level spi transfer */

static void stm32_ili93414ws_modifyreg(uint32_t reg, uint16_t setbits,
              uint16_t clrbits);
static inline void stm32_ili93414ws_modifycr1(uint16_t setbits,
              uint16_t clrbits);
static inline void stm32_ili93414ws_modifycr2(uint16_t setbits,
              uint16_t clrbits);
static void stm32_ili93414ws_spisendmode(void);
static void stm32_ili93414ws_spirecvmode(void);
static void stm32_ili93414ws_spienable(void);
static void stm32_ili93414ws_spidisable(void);

static inline void stm32_ili93414ws_set8bitmode(
              struct ili93414ws_lcd_s *dev);
static inline void stm32_ili93414ws_set16bitmode(
              struct ili93414ws_lcd_s *dev);

/* Command and data transmission control */

static void stm32_ili93414ws_sndword(uint16_t wd);
static int stm32_ili93414ws_sendblock(struct ili93414ws_lcd_s *lcd,
              const uint16_t *wd, uint16_t nwords);
static uint16_t stm32_ili93414ws_recvword(void);
static int stm32_ili93414ws_recvblock(struct ili93414ws_lcd_s *lcd,
              uint16_t *wd, uint16_t nwords);
static inline void stm32_ili93414ws_cmddata(
              struct ili9341_lcd_s *lcd, bool cmd);

/* Initializing / Configuration */

static void stm32_ili93414ws_spiconfig(struct ili9341_lcd_s *lcd);

/****************************************************************************
 * Private Data
 ****************************************************************************/

struct ili93414ws_lcd_s g_lcddev;

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: stm32_ili93414ws_modifyreg
 *
 * Description:
 *   Clear and set bits in the CR register (based on
 *   arch/arm/src/common/stm32/stm32_spi.h).
 *
 * Input Parameters:
 *   reg      - register to set
 *   clrbits  - The bits to clear
 *   setbits  - The bits to set
 *
 * Returned Value:
 *
 ****************************************************************************/

static void stm32_ili93414ws_modifyreg(uint32_t reg, uint16_t setbits,
                                       uint16_t clrbits)
{
  uint16_t regval;

  regval  = getreg16(reg);
  regval &= ~clrbits;
  regval |= setbits;
  putreg16(regval, reg);
}

/****************************************************************************
 * Name: stm32_ili93414ws_modifycr1
 *
 * Description:
 *   Clear and set bits in the CR1 register.
 *
 * Input Parameters:
 *   clrbits - The bits to clear
 *   setbits - The bits to set
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static inline void stm32_ili93414ws_modifycr1(uint16_t setbits,
                                              uint16_t clrbits)
{
  stm32_ili93414ws_modifyreg(ILI93414WS_SPI_CR1, setbits, clrbits);
}

/****************************************************************************
 * Name: stm32_ili93414ws_modifycr2
 *
 * Description:
 *   Clear and set bits in the CR2 register.
 *
 * Input Parameters:
 *   clrbits - The bits to clear
 *   setbits - The bits to set
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static inline void stm32_ili93414ws_modifycr2(uint16_t setbits,
                                              uint16_t clrbits)
{
  stm32_ili93414ws_modifyreg(ILI93414WS_SPI_CR2, setbits, clrbits);
}

/****************************************************************************
 * Name: stm32_ili93414ws_spirecvmode
 *
 * Description:
 *   Sets the spi device to the bidirectional receive mode
 *
 * Input Parameters:
 *
 * Returned Value:
 *
 ****************************************************************************/

