apache/nuttx/boards/arm/stm32f4/stm32f429i-disco/src/stm32_ili93414ws.c
static void stm32_ili93414ws_spirecvmode(void)
{
  /* Set to bidirectional rxonly mode */

  stm32_ili93414ws_modifycr1(0, SPI_CR1_BIDIOE);

  /* Disable spi */

  stm32_ili93414ws_spidisable();

  /* Clear the rx buffer if received data exist e.g. from previous
   * broken transfer.
   */

  getreg16(ILI93414WS_SPI_DR);
}

/****************************************************************************
 * Name: stm32_ili93414ws_spisendmode
 *
 * Description:
 *   Sets the spi device to the bidirectional transmit mode
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void stm32_ili93414ws_spisendmode(void)
{
  /* Set to bidirectional transmit mode */

  stm32_ili93414ws_modifycr1(SPI_CR1_BIDIOE, 0);

  /* enable spi */

  stm32_ili93414ws_spienable();
}

/****************************************************************************
 * Name: stm32_ili93414ws_spienable
 *
 * Description:
 *   Enable the spi device
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void stm32_ili93414ws_spienable(void)
{
  uint16_t  regval;

  regval = getreg16(ILI93414WS_SPI_CR1);
  regval |= SPI_CR1_SPE;
  putreg16(regval, ILI93414WS_SPI_CR1);
}

/****************************************************************************
 * Name: stm32_ili93414ws_spidisable
 *
 * Description:
 *   Disable the spi device
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void stm32_ili93414ws_spidisable(void)
{
  uint16_t  regval;

  regval = getreg16(ILI93414WS_SPI_CR1);
  regval &= ~SPI_CR1_SPE;
  putreg16(regval, ILI93414WS_SPI_CR1);
}

/****************************************************************************
 * Name: stm32_ili93414ws_sndword
 *
 * Description:
 *   Send a word to the lcd driver.
 *
 * Input Parameters:
 *   wd  - word to send
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void stm32_ili93414ws_sndword(uint16_t wd)
{
  /* Send the word */

  putreg16(wd, ILI93414WS_SPI_DR);

  /* Wait until the transmit buffer is empty */

  while ((getreg16(ILI93414WS_SPI_SR) & SPI_SR_TXE) == 0);
}

/****************************************************************************
 * Name: stm32_ili93414ws_sendblock
 *
 * Description:
 *   Send a number of words to the lcd driver.
 *
 * Input Parameters:
 *   spi    - Reference to the private device structure
 *   wd     - Reference to the words to send
 *   nwords - number of words to send
 *
 * Returned Value:
 *   On success - OK
 *
 ****************************************************************************/

static int stm32_ili93414ws_sendblock(struct ili93414ws_lcd_s *lcd,
                                      const uint16_t *wd, uint16_t nwords)
{
  /* Set to bidirectional transmit mode and enable spi */

  stm32_ili93414ws_spisendmode();

  /* Check if 16-bit spi mode is configured for transmit */

#ifdef CONFIG_STM32F429I_DISCO_ILI9341_SPIBITS16
  if ((getreg16(ILI93414WS_SPI_CR1) & SPI_CR1_DFF) != 0)
    {
      /* 16-bit spi mode */

      const uint16_t *src  = wd;
            uint16_t word;

      while (nwords-- > 0)
        {
          word = *src++;
          stm32_ili93414ws_sndword(word);
        }
    }
#else
  /* 8-bit spi mode is enabled for pixel data operations.
   * Each pixel must be transmitted by two write operations.
   */

  if (lcd->gmode == 16)
    {
      /* 8-bit spi mode */

      const uint16_t *src  = wd;
            uint16_t word;

      while (nwords-- > 0)
        {
          word = *src++;
          stm32_ili93414ws_sndword((word >> 8));
          stm32_ili93414ws_sndword((word & 0xff));
        }
    }
#endif
  else
    {
      /* 8-bit spi mode */

      const uint8_t *src = (const uint8_t *)wd;
      uint8_t word;

      while (nwords-- > 0)
        {
          word = *src++;
          stm32_ili93414ws_sndword((uint16_t)word);
        }
    }

  /* Wait until transmit is not busy after the last word is transmitted,
   * marked by the BSY flag in the cr1 register. This is necessary if
   * entering in halt mode or disable the spi periphery.
   */

  while ((getreg16(ILI93414WS_SPI_SR) & SPI_SR_BSY) != 0);

  /* Disable spi */

  stm32_ili93414ws_spidisable();

  return OK;
}

/****************************************************************************
 * Name: stm32_ili93414ws_recvword
 *
 * Description:
 *   Receive a word from the lcd driver.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   On success - The received word from the LCD Single Chip Driver.
 *   On error   - 0 (If timeout during receiving)
 *
 ****************************************************************************/

static uint16_t stm32_ili93414ws_recvword(void)
{
  volatile int       n;
  volatile uint16_t  regval;
         irqstate_t  flags;

  /* Disable interrupts during time critical spi sequence.
   * In bidrectional receive mode the data transfer can only be stopped by
   * disabling the spi device. This is here done by disabling the spi device
   * immediately after enabling it. If the pixel data stream is interrupted
   * during receiving, a synchronized transfer can not ensure. Especially on
   * higher frequency it can happen that the interrupted driver isn't fast
   * enough to stop transmitting by disabling the spi device. So pixels lost
   * but not recognized by the driver. This results in a big lock because
   * the driver wants to receive missing pixel data.
   * The critical section here ensures that the spi device is disabled fast
   * enough during a pixel is transmitted.
   */

  flags = enter_critical_section();

  /* Backup the content of the current cr1 register only 1 times */

  regval = getreg16(ILI93414WS_SPI_CR1);

  /* Enable spi device followed by disable the spi device.
   *
   * Ensure that the spi is disabled within 8 or 16 spi clock cycles
   * depending on the configured spi bit mode. This is necessary to prevent
   * that the next data word is transmitted by the slave before the RX
   * buffer is cleared.
   * Otherwise the RX buffer will be overwritten.
   *
   * Physically the spi clock is disabled after the current 8/16 clock cycles
   * are completed.
   */

