apache/nuttx/boards/arm/stm32f4/stm32f429i-disco/src/stm32_ili93414ws.c
  regval |= SPI_CR1_SPE;
  putreg16(regval, ILI93414WS_SPI_CR1);

  /* Disable spi device */

  regval &= ~SPI_CR1_SPE;
  putreg16(regval, ILI93414WS_SPI_CR1);

  /* The spi device is in disabled state so it is safe to enable interrupts */

  leave_critical_section(flags);

  /* Waits until the RX buffer is filled with the received data word
   * signalized by the spi hardware through the RXNE flag.
   * A busy loop is preferred against interrupt driven receiving method here
   * because this happened fairly often. Also we have to ensure to avoid a
   * big lock if the lcd driver doesn't send data anymore.
   * A latency of CPU clock / SPI clock * 16 SPI clocks should be enough
   * here.
   */

  for (n = 0; n < ILI93414WS_RECV_CLK * 16; n++)
    {
      if ((getreg16(ILI93414WS_SPI_SR) & SPI_SR_RXNE) != 0)
        {
          /* Receive the data word from the RX buffer */

          return getreg16(ILI93414WS_SPI_DR);
        }
    }

  lcdinfo("Timeout during receiving pixel word\n");

  return 0;
}

/****************************************************************************
 * Name: stm32_ili93414ws_recvblock
 *
 * Description:
 *   Receive a number of words from to the lcd driver.
 *   Note: The first received word is the dummy word and discarded!
 *
 * Input Parameters:
 *   spi    - Reference to the private device structure
 *   wd    -  Reference to where the words receive
 *   nwords - number of words to receive
 *
 * Returned Value:
 *  OK - On Success
 *
 ****************************************************************************/

static int stm32_ili93414ws_recvblock(struct ili93414ws_lcd_s *lcd,
                                uint16_t *wd, uint16_t nwords)
{
  /* ili9341 uses a 18-bit pixel format packed in a 24-bit stream per pixel.
   * The following format is transmitted: RRRRRR00 GGGGGG00 BBBBBB00
   * Convert it to:                       RRRRRGGG GGGBBBBB
   */

  /* Set to bidirectional transmit mode and disable spi */

  stm32_ili93414ws_spirecvmode();

  /* Check if 16-bit spi mode is configured for receive */

#ifdef CONFIG_STM32F429I_DISCO_ILI9341_SPIBITS16
  /* Two contiguous pixel must be received by three read operations. */

  if ((getreg16(ILI93414WS_SPI_CR1) & SPI_CR1_DFF) != 0)
    {
      /* 16-bit mode */

      uint16_t *dest  = wd;
      uint16_t w1;
      uint16_t w2;

      /* Receive first pixel */

      if (nwords)
        {
          /* Discard the first 8 bit dummy */

          /* 00000000 RRRRRR00 */

          w1 = stm32_ili93414ws_recvword();

          /* GGGGGG00 BBBBBB00 */

          w2 = stm32_ili93414ws_recvword();

          *dest++ = (((w1 << 8) & 0xf800) |
                     ((w2 >> 2) & 0x7e0) |
                     ((w2 >> 3) & 0x1f));

          --nwords;
        }

      /* Receive
       * if nwords even and greater than 2: pixel 2 to n-1
       * if nwords odd and greater than 2:  pixel 2 to n
       */

      while (nwords--)
        {
          /* RRRRRR00 GGGGGG00 */

          w1 = stm32_ili93414ws_recvword();

          /* BBBBBB00 RRRRRR00 */

          w2 = stm32_ili93414ws_recvword();

          *dest++ = ((w1 & 0xf800) | ((w1 << 3) & 0x7e0) | (w2 >> 11));

          if (!nwords)
            {
              break;
            }

          /* GGGGGG00 BBBBBB00 */

          w1 = stm32_ili93414ws_recvword();

          *dest++ = (((w1 >> 5) & 0x7e0) |
                     ((w1 >> 3) & 0x1f) |
                     ((w2 << 8) & 0xf800));

          --nwords;
        }
    }
#else
  /* 8-bit spi mode is enabled for pixel data operations.
   * Each pixel must be received by three read operations.
   */

  if (lcd->gmode == 16)
    {
      /* 8-bit spi mode but 16-bit mode is done by two 8-bit transmits */

      uint16_t *dest = wd;

      /* Dummy read to discard the first 8 bit. */

      stm32_ili93414ws_recvword();

      while (nwords--)
        {
          uint8_t r;
          uint8_t g;
          uint8_t b;

          r = (uint8_t)(stm32_ili93414ws_recvword() >> 3);
          g = (uint8_t)(stm32_ili93414ws_recvword() >> 2);
          b = (uint8_t)(stm32_ili93414ws_recvword() >> 3);
          *dest++ = ((r << 11) | (g << 5) | b);
        }
    }
#endif
  else
    {
      /* 8-bit mode */

      uint8_t *dest = (uint8_t *)wd;

      while (nwords--)
        {
          *dest++ = (uint8_t)stm32_ili93414ws_recvword();
        }
    }

  /* Disable spi device is done by recvword  */

  return OK;
}

/****************************************************************************
 * Name: stm32_ili93414ws_set8bitmode
 *
 * Description:
 *   Set spi device to 8-bit data format
 *
 * Input Parameters:
 *   dev  - Reference to the private driver structure
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static inline void stm32_ili93414ws_set8bitmode(
                      struct ili93414ws_lcd_s *dev)
{
  stm32_ili93414ws_modifycr1(0, SPI_CR1_DFF);
#ifndef CONFIG_STM32F429I_DISCO_ILI9341_SPIBITS16
  dev->gmode = 8;
#endif
}

#ifdef CONFIG_STM32F429I_DISCO_ILI9341_SPIBITS16
/****************************************************************************
 * Name: stm32_ili93414ws_set16bitmode
 *
 * Description:
 *   Set spi device to 16-bit data format.
 *
 * Input Parameters:
 *   dev  - Reference to the private driver structure
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static inline void stm32_ili93414ws_set16bitmode(
                      struct ili93414ws_lcd_s *dev)
{
  stm32_ili93414ws_modifycr1(SPI_CR1_DFF, 0);
}
#else

static inline void stm32_ili93414ws_set16bitmode(
                      struct ili93414ws_lcd_s *dev)
{
  dev->gmode = 16;
}
#endif

/****************************************************************************
 * Name: stm32_ili93414ws_spiconfig
 *
 * Description:
 *   Disable spi device and configure to bidirectional mode.
 *
 * Input Parameters:
 *   lcd  - Reference to the private driver structure
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

