apache/nuttx/boards/arm/stm32f4/stm32f429i-disco/src/stm32_ili93414ws.c
static void stm32_ili93414ws_spiconfig(struct ili9341_lcd_s *lcd)
{
  struct ili93414ws_lcd_s *priv = (struct ili93414ws_lcd_s *)lcd;
  irqstate_t   flags;

  uint16_t   clrbitscr1 = SPI_CR1_CPHA | SPI_CR1_CPOL | SPI_CR1_BR_MASK |
                          SPI_CR1_CRCEN | SPI_CR1_LSBFIRST | SPI_CR1_RXONLY |
                          SPI_CR1_DFF;

  uint16_t   setbitscr1 = SPI_CR1_BIDIOE | SPI_CR1_BIDIMODE | SPI_CR1_MSTR |
                          SPI_CR1_SSI | SPI_CR1_SSM | ILI93414WS_SPI_BR;

  uint16_t   clrbitscr2 = SPI_CR2_TXEIE | SPI_CR2_RXNEIE | SPI_CR2_ERRIE |
                          SPI_CR2_FRF | SPI_CR2_SSOE;

  uint16_t   setbitscr2 = 0;

  flags = enter_critical_section();

  /* Disable spi */

  stm32_ili93414ws_spidisable();

  /* Set to default 8-bit transfer mode */

  stm32_ili93414ws_set8bitmode(priv);

#ifdef ILI93414WS_SPI
  /* Backup cr1 and cr2 register to be sure they will be usable
   * by default spi interface. Disable spi device here is necessary at the
   * time restoring the register during deselection.
   */

  priv->cr2 = getreg16(ILI93414WS_SPI_CR2);
  priv->cr1 = getreg16(ILI93414WS_SPI_CR1);
#endif

  /* Set spi device to bidirectional half duplex
   * Configure to master with 8-bit data format and SPIDEV_MODE0
   */

  stm32_ili93414ws_modifycr1(setbitscr1, clrbitscr1);

  /* Disable dma, set to motorola spi. */

  stm32_ili93414ws_modifycr2(setbitscr2, clrbitscr2);

  leave_critical_section(flags);
}

/****************************************************************************
 * Name: stm32_ili93414ws_cmddata
 *
 * Description:
 *   Select command or data transfer mode
 *
 * Input Parameters:
 *   lcd  - Reference to the private driver structure
 *   cmd  - Refers to command or parameter
 *
 * Returned Value:
 *
 ****************************************************************************/

#ifdef ILI93414WS_SPI
static inline void stm32_ili93414ws_cmddata(
                      struct ili9341_lcd_s *lcd, bool cmd)
{
  struct ili93414ws_lcd_s *priv = (struct ili93414ws_lcd_s *)lcd;

  SPI_CMDDATA(priv->spi, SPIDEV_DISPLAY(0), cmd);
}
#else
static inline void stm32_ili93414ws_cmddata(
                      struct ili9341_lcd_s *lcd, bool cmd)
{
  stm32_gpiowrite(GPIO_LCD_DC, !cmd);
}
#endif

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: stm32_ili93414ws_backlight
 *
 * Description:
 *   Set the backlight level of the connected display.
 *
 * Input Parameters:
 *   spi   - Reference to the public driver structure
 *   level - backligth level
 *
 * Returned Value:
 *   OK - On Success
 *
 ****************************************************************************/

static int stm32_ili93414ws_backlight(struct ili9341_lcd_s *lcd,
                                      int level)
{
  return OK;
}

/****************************************************************************
 * Name: stm32_ili93414ws_select
 *
 * Description:
 *   Select the SPI, locking and re-configuring if necessary
 *
 * Input Parameters:
 *   spi  - Reference to the public driver structure
 *
 * Returned Value:
 *
 ****************************************************************************/

#ifdef ILI93414WS_SPI
static void stm32_ili93414ws_select(struct ili9341_lcd_s *lcd)
{
  struct ili93414ws_lcd_s *priv = (struct ili93414ws_lcd_s *)lcd;

  /* Select ili9341 (locking the SPI bus in case there are multiple
   * devices competing for the SPI bus
   */

  SPI_LOCK(priv->spi, true);
  SPI_SELECT(priv->spi, SPIDEV_DISPLAY(0), true);

  /* Configure spi and disable */

  stm32_ili93414ws_spiconfig(lcd);
}
#else
static void stm32_ili93414ws_select(struct ili9341_lcd_s *lcd)
{
  /* We own the spi bus, so just select the chip */

  stm32_gpiowrite(GPIO_CS_LCD, false);

  /* Disable spi */

  stm32_ili93414ws_spidisable();
}
#endif

/****************************************************************************
 * Name: stm32_ili93414ws_deselect
 *
 * Description:
 *   De-select the SPI
 *
 * Input Parameters:
 *   spi  - Reference to the public driver structure
 *
 * Returned Value:
 *
 ****************************************************************************/

#ifdef ILI93414WS_SPI
static void stm32_ili93414ws_deselect(struct ili9341_lcd_s *lcd)
{
  irqstate_t   flags;
  struct ili93414ws_lcd_s *priv = (struct ili93414ws_lcd_s *)lcd;

  flags = enter_critical_section();

  /* Restore cr1 and cr2 register to be sure they will be usable
   * by default spi interface structure. (This is an important workaround as
   * long as half duplex mode is not supported by the spi interface in
   * arch/arm/src/common/stm32/stm32_spi.h).
   */

  putreg16(priv->cr2, ILI93414WS_SPI_CR2);
  putreg16(priv->cr1, ILI93414WS_SPI_CR1);

  /* Enable spi device is default for initialized spi ports (see
   * arch/arm/src/common/stm32/stm32_spi.h).
   */

  stm32_ili93414ws_spienable();

  leave_critical_section(flags);

  /* de-select ili9341 and relinquish the spi bus. */

  SPI_SELECT(priv->spi, SPIDEV_DISPLAY(0), false);
  SPI_LOCK(priv->spi, false);
}
#else
static void stm32_ili93414ws_deselect(struct ili9341_lcd_s *lcd)
{
  stm32_gpiowrite(GPIO_CS_LCD, true);
}
#endif

/****************************************************************************
 * Name: stm32_ili93414ws_sndcmd
 *
 * Description:
 *   Send a command to the lcd driver.
 *
 * Input Parameters:
 *   lcd  - Reference to the ili9341_lcd_s driver structure
 *   cmd  - command to send
 *
 * Returned Value:
 *   On success - OK
 *
 ****************************************************************************/

static int stm32_ili93414ws_sendcmd(
              struct ili9341_lcd_s *lcd, const uint8_t cmd)
{
  int ret;
  const uint16_t bw = (const uint16_t)cmd;
  struct ili93414ws_lcd_s *priv = (struct ili93414ws_lcd_s *)lcd;

  /* Set to 8-bit mode in disabled state, spi device is in disabled state */

  stm32_ili93414ws_set8bitmode(priv);

  lcdinfo("cmd=%04x\n", bw);
  stm32_ili93414ws_cmddata(lcd, true);
  ret = stm32_ili93414ws_sendblock(priv, &bw, 1);
  stm32_ili93414ws_cmddata(lcd, false);

  return ret;
}

/****************************************************************************
 * Name: stm32_ili93414ws_sendparam
 *
 * Description:
 *   Send a parameter to the lcd driver.
 *
 * Input Parameters:
 *   lcd    - Reference to the ili9341_lcd_s driver structure
 *   param  - parameter to send
 *
 * Returned Value:
 *   OK - On Success
 *
 ****************************************************************************/

