apache/nuttx/boards/arm/stm32f4/stm32f429i-disco/src/stm32_ili93414ws.c
static int stm32_ili93414ws_sendparam(struct ili9341_lcd_s *lcd,
                                      const uint8_t param)
{
  struct ili93414ws_lcd_s *priv = (struct ili93414ws_lcd_s *)lcd;
  const uint16_t bw = (const uint16_t)param;

  /* Set to 8-bit mode in disabled state, spi device is in disabled state */

  stm32_ili93414ws_set8bitmode(priv);

  lcdinfo("param=%04x\n", bw);
  return stm32_ili93414ws_sendblock(priv, &bw, 1);
}

/****************************************************************************
 * Name: stm32_ili93414ws_sendgram
 *
 * Description:
 *   Send a number of pixel words to the lcd driver gram.
 *
 * Input Parameters:
 *   lcd    - Reference to the ili9341_lcd_s driver structure
 *   wd     - Reference to the words to send
 *   nwords - number of words to send
 *
 * Returned Value:
 *   OK - On Success
 *
 ****************************************************************************/

static int stm32_ili93414ws_sendgram(struct ili9341_lcd_s *lcd,
                                     const uint16_t *wd, uint32_t nwords)
{
  struct ili93414ws_lcd_s *priv = (struct ili93414ws_lcd_s *)lcd;

  lcdinfo("wd=%p, nwords=%" PRId32 "\n", wd, nwords);

  /* Set to 16-bit mode transfer mode, spi device is in disabled state */

  stm32_ili93414ws_set16bitmode(priv);

  return stm32_ili93414ws_sendblock(priv, wd, nwords);
};

/****************************************************************************
 * Name: stm32_ili93414ws_recvparam
 *
 * Description:
 *   Receive a parameter from the lcd driver.
 *
 * Input Parameters:
 *   lcd    - Reference to the ili9341_lcd_s driver structure
 *   param  - Reference to where parameter receive
 *
 * Returned Value:
 *   OK - On Success
 *
 ****************************************************************************/

static int stm32_ili93414ws_recvparam(struct ili9341_lcd_s *lcd,
                                      uint8_t *param)
{
  struct ili93414ws_lcd_s *priv = (struct ili93414ws_lcd_s *)lcd;

#ifdef CONFIG_STM32F429I_DISCO_ILI9341_SPIBITS16
  /* Set to 8-bit mode in disabled state, spi device is in disabled state. */

  stm32_ili93414ws_set8bitmode(priv);
#endif

  lcdinfo("param=%p\n", param);
  return stm32_ili93414ws_recvblock(priv, (uint16_t *)param, 1);
}

/****************************************************************************
 * Name: stm32_ili93414ws_recvgram
 *
 * Description:
 *   Receive pixel words from the lcd driver gram.
 *
 * Input Parameters:
 *   lcd    - Reference to the public driver structure
 *   wd     - Reference to where the pixel words receive
 *   nwords - number of pixel words to receive
 *
 * Returned Value:
 *   OK - On Success
 *
 ****************************************************************************/

static int stm32_ili93414ws_recvgram(struct ili9341_lcd_s *lcd,
                                     uint16_t *wd, uint32_t nwords)
{
  struct ili93414ws_lcd_s *priv = (struct ili93414ws_lcd_s *)lcd;

  lcdinfo("wd=%p, nwords=%" PRId32 "\n", wd, nwords);

  /* Set to 16-bit mode in disabled state */

  stm32_ili93414ws_set16bitmode(priv);

  return stm32_ili93414ws_recvblock(priv, wd, nwords);
};

/****************************************************************************
 * Name:  stm32_ili93414ws_initialize
 *
 * Description:
 *   Initialize the device structure to control the LCD Single chip driver.
 *
 * Input Parameters:
 *
 * Returned Value:
 *   On success, this function returns a reference to the LCD control object
 *   for the specified ILI9341 LCD Single chip driver connected as 4 wire
 *   serial (spi). NULL is returned on any failure.
 *
 ****************************************************************************/

#ifdef ILI93414WS_SPI
struct ili9341_lcd_s *stm32_ili93414ws_initialize(void)
{
  struct spi_dev_s *spi;
  struct ili93414ws_lcd_s *priv = &g_lcddev;

  lcdinfo("initialize ili9341 4-wire serial subdriver\n");

  lcdinfo("initialize spi device: %d\n", ILI93414WS_SPI_DEVICE);
  spi = stm32_spi5initialize();

  if (spi)
    {
      /* Initialize structure */

      priv->dev.select      = stm32_ili93414ws_select;
      priv->dev.deselect    = stm32_ili93414ws_deselect;
      priv->dev.sendcmd     = stm32_ili93414ws_sendcmd;
      priv->dev.sendparam   = stm32_ili93414ws_sendparam;
      priv->dev.recvparam   = stm32_ili93414ws_recvparam;
      priv->dev.sendgram    = stm32_ili93414ws_sendgram;
      priv->dev.recvgram    = stm32_ili93414ws_recvgram;
      priv->dev.backlight   = stm32_ili93414ws_backlight;
      priv->spi             = spi;

      return &priv->dev;
    }

  return NULL;
}

#else

struct ili9341_lcd_s *stm32_ili93414ws_initialize(void)
{
  uint32_t    regval;
  struct ili93414ws_lcd_s *priv = &g_lcddev;

  lcdinfo("initialize ili9341 4-wire serial subdriver\n");

  /* Enable spi bus */

  regval = getreg32(STM32_RCC_APB2ENR);
  regval |= RCC_APB2ENR_SPI5EN;
  putreg32(regval, STM32_RCC_APB2ENR);

  /* Configure gpios */

  stm32_configgpio(GPIO_CS_LCD);     /* LCD chip select */
  stm32_configgpio(GPIO_LCD_DC);     /* LCD Data/Command select */
  stm32_configgpio(GPIO_LCD_ENABLE); /* LCD enable select */
  stm32_configgpio(GPIO_SPI5_SCK);   /* SPI clock */
  stm32_configgpio(GPIO_SPI5_MOSI);  /* SPI MOSI */

  /* Initialize structure */

  priv->dev.select      = stm32_ili93414ws_select;
  priv->dev.deselect    = stm32_ili93414ws_deselect;
  priv->dev.sendcmd     = stm32_ili93414ws_sendcmd;
  priv->dev.sendparam   = stm32_ili93414ws_sendparam;
  priv->dev.recvparam   = stm32_ili93414ws_recvparam;
  priv->dev.sendgram    = stm32_ili93414ws_sendgram;
  priv->dev.recvgram    = stm32_ili93414ws_recvgram;
  priv->dev.backlight   = stm32_ili93414ws_backlight;

  /* Configure to bidirectional transfer mode */

  lcdinfo("Configure spi device %d to bidirectional transfer mode\n",
            ILI93414WS_SPI_DEVICE);

  stm32_ili93414ws_spiconfig(&priv->dev);

  return &priv->dev;
}
#endif
